DataProcessors/ЗагрузкаНоменклатурыИзФайла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаНоменклатурыИзФайла</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКартинки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаНоменклатурыИзФайла/Forms/Форма1/Ext/Form/Module.bsl
&НаСервере
Функция ВыгрузитьДанныеНаСервере(ТабДок)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("МакетТЗ");
	
	ОбластьШапкаВыгрузки = Макет.ПолучитьОбласть("ШапкаВыгрузки");

	ТабДок.Вывести(ОбластьШапкаВыгрузки); 
			
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите путь для сохранения"; 

	Если ДиалогОткрытия.Выбрать() Тогда 
		ПутьККаталогу = ДиалогОткрытия.Каталог; 
	КонецЕсли;   
	
	Если Прав(ПутьККаталогу,1) <> "\" Тогда
		КаталогСохранения = ПутьККаталогу+"\";
	Иначе
		КаталогСохранения = ПутьККаталогу; 
		
	КонецЕсли;
	
	
	//Сформируем уникальное имя файла 
	ДатаИВремя = СтрЗаменить(ТекущаяДата(),":",".");
	ИмяФайла = "Шаблон загрузки номенклатуры " + ДатаИВремя;  
	
	//Создадим табличный документ
	ТабДок = Новый ТабличныйДокумент;
	
	//Добавим выбранный каталог к именя файла 
	ПолноеИмяФайла = КаталогСохранения + ИмяФайла + ".xls";
	
	// Определим в каком формате будет выгружен документ
	
    ЗадатьТип =  ТипФайлаТабличногоДокумента.xls;   
	
	 //Создадим файл и запишем в табличный документ
		ТабДок.Записать(ПолноеИмяФайла, ЗадатьТип); 
		
		//Заполним ТабДок на сервере
		ВыгрузитьДанныеНаСервере(ТабДок);
		
		//Запишем заполненную таблицу в тот же файл
		
		ТабДок.Записать(ПолноеИмяФайла, ЗадатьТип);    		

	Сообщить("Выгрузка данных успешно завершена!");
	
КонецПроцедуры

//Загрузка
&НаСервере
Процедура ПрочитатьExcel_ТабличныйДокумент(ПутьКФайлу)
	
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(ПутьКФайлу);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();                                                        
		Возврат;
	КонецПопытки;
	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	КоличествоКолонок = ТабДок.ШиринаТаблицы;
		
	Для НомерСтроки = 2 По КоличествоСтрок Цикл
		
		НаименованиеНоменклатуры = ТабДок.Область(НомерСтроки, 1).Текст;
		ВидНоменклатуры = ТабДок.Область(НомерСтроки, 2).Текст;
		Описание = ТабДок.Область(НомерСтроки, 3).Текст;
		ЕдИзм = ТабДок.Область(НомерСтроки, 4).Текст;
		Производитель = ТабДок.Область(НомерСтроки, 5).Текст;
		
		
		НоменклатураСсылка = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеНоменклатуры);
		
		Если НЕ ЗначениеЗаполнено(НоменклатураСсылка) Тогда
				
			НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			
			НоменклатураОбъект.Наименование = НаименованиеНоменклатуры;
			НоменклатураОбъект.Описание = Описание;
			НоменклатураОбъект.ВидНоменклатуры = ПолучитьВидНоменклатуры(ВидНоменклатуры);
			НоменклатураОбъект.ЕдИзм = СоздатьПолучитьЕдиницуИзмерения(ЕдИзм);
			НоменклатураОбъект.Производитель = СоздатьПолучитьПроизводителя(Производитель);
			
			НоменклатураОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры 

&НаСервере
Процедура ПрочитатьExcelНаСервере(АдресДанных, РасширениеФайла)
	
	ПутьКфайлу = ПолучитьИмяВременногоФайла(РасширениеФайла);         
	
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	Данные.Записать(ПутьКфайлу);
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ПрочитатьExcel_ТабличныйДокумент(ПутьКфайлу);
	
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Длительность = (ВремяОкончания - ВремяНачала) / 1000;
	
	// удаление временного файла
	УдалитьФайлы(ПутьКфайлу);
		
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон("Обработка файла завершена! Длительность операции: %1", Длительность);
	Сообщение.Сообщить();
	
КонецПроцедуры
	
&НаКлиенте
Асинх Процедура ПрочитатьExcel(Команда)
	
		ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
		ПараметрыДиалога.Заголовок = "Выберите файл";
		ПараметрыДиалога.Фильтр = "Таблица Excel | *.xls; *.xlsx";
		
		ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога);
		Если ОписаниеФайла <> Неопределено Тогда
			ПрочитатьExcelНаСервере(ОписаниеФайла.Адрес, ОписаниеФайла.СсылкаНаФайл.Расширение);
		КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПолучитьЕдиницуИзмерения(НаименованиеСправочника)
	
	Если НЕ ЗначениеЗаполнено(НаименованиеСправочника) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СправочникСсылка = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(НаименованиеСправочника);

	Если НЕ ЗначениеЗаполнено(СправочникСсылка) Тогда
		СправочникОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		СправочникОбъект.Наименование = НаименованиеСправочника;
		СправочникОбъект.Записать();
		
		СправочникСсылка = СправочникОбъект.Ссылка;
	КонецЕсли;
	
	Возврат СправочникСсылка;
	
	
КонецФункции


&НаСервере
Функция СоздатьПолучитьПроизводителя(НаименованиеСправочника)
	
	Если НЕ ЗначениеЗаполнено(НаименованиеСправочника) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СправочникСсылка = Справочники.Производители.НайтиПоНаименованию(НаименованиеСправочника);

	Если НЕ ЗначениеЗаполнено(СправочникСсылка) Тогда
		СправочникОбъект = Справочники.Производители.СоздатьЭлемент();
		СправочникОбъект.Наименование = НаименованиеСправочника;
		СправочникОбъект.Записать();
		
		СправочникСсылка = СправочникОбъект.Ссылка;
	КонецЕсли;
	
	Возврат СправочникСсылка;
	
	
КонецФункции

&НаСервере
Функция ПолучитьВидНоменклатуры(ВидСтрока)
	
	Если НЕ ЗначениеЗаполнено(ВидСтрока) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ВидСтрока = "Товар" тогда
		Возврат Перечисления.ВидыНоменклатуры.Товар;
	ИначеЕсли ВидСтрока = "Услуга" Тогда
		Возврат Перечисления.ВидыНоменклатуры.Услуга;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
		
КонецФункции
